In [563]:
import pandas as pd
import numpy as np

In [564]:
# Load the data
df = pd.read_csv('salary_history.csv')

In [577]:
df.shape

(46450, 19)

In [578]:
# unique mlbid
df['mlbid'].nunique()

8651

In [575]:
# concat first and last name
# df['name'] = df['firstname'] + ' ' + df['lastname']

In [566]:
# change born date to datetime
df['borndate'] = pd.to_datetime(df['borndate']).dt.date

In [567]:
def change_borndate(name, born):
    df.loc[df['name'] == name, 'borndate'] = born
    # save to csv
    df.to_csv('salary_history.csv', index=False)

In [568]:
change_borndate('Yainer Diaz', '2000-08-08')

In [569]:
# First three letters of the first name
df['first3'] = df['firstname'].str[:3]

#first three letters of the last name
df['last3'] = df['lastname'].str[:3]

# two middle letters of the first name
# df['middle2'] = df['firstname'].str[1:4]

# concat first3 and Delwyn Younglast3
df['first3last3'] = df['first3'] + df['last3']

In [576]:
pd.set_option('display.max_rows', None)
# Show Ernie Youn
# df[df['name'] == "Joey Gallo"][['name', 'borndate', 'mlbid', 'year', 'salary']]

             name    borndate   mlbid  year    salary
14141  Joey Gallo  1993-11-19  608336  2015    507500
14142  Joey Gallo  1993-11-19  608336  2016    509500
14143  Joey Gallo  1993-11-19  608336  2017    537120
14144  Joey Gallo  1993-11-19  608336  2018    560000
14145  Joey Gallo  1993-11-19  608336  2019    605500
14146  Joey Gallo  1993-11-19  608336  2020   4400000
14147  Joey Gallo  1993-11-19  608336  2021   6200000
14148  Joey Gallo  1993-11-19  608336  2022  10275000
14149  Joey Gallo  1993-11-19  608336  2023  11000000

In [571]:
# 116424
df[df['mlbid'] == 150193][['name', 'borndate', 'mlbid', 'year']]

              name    borndate   mlbid  year
14363  Luis Garcia  1700-04-08  150193  1999

In [572]:
# change borndate of Carlos Martinez mlbid 114924
df.loc[df['mlbid'] == 150193, 'borndate'] = '1700-04-08'

In [573]:
# Change Travis D'Arnaud last name
# df.loc[df['name'] == "Yurendell Decaster", 'lastname'] = 'de Caster'

In [574]:
# save to csv
df.to_csv('salary_history.csv', index=False)